class Guns:
    def __init__(self, name, weight, accuracy, convenience, damage, rate, rrange, magazine, caliber, caliber2,
                 caliber3):
        self.name = name #Наименование
        self.weight = weight  # вес
        self.accuracy = accuracy  # точность
        self.convenience = convenience  # удобность
        self.damage = damage  # повреждение
        self.rate = rate  # скорострельность
        self.rrange = rrange  # дальность
        self.magazine = magazine  # ёмкость обоймы
        self.caliber = caliber  # Калибр1
        self.caliber2 = caliber2  # Калибр2
        self.caliber3 = caliber3  # Калибр3 если нет то 0


# Пистолеты 9х18
pm = Guns("Пистолет макарова", 0.73, 10.8, 51, 5.8, 15.7, 50, 8, 9.18, 9.28, 0)
pb_1c = Guns("ПБ-1с", 0.97, 13.7, 50.8, 5.88, 16.9, 50, 8, 9.18, 9.28, 0)
fora_12 = Guns("Фора-12", 0.83, 16.54, 60, 7.06, 16.93, 50, 12, 9.18, 9.28, 0)
# Пистолеты 9х19
xpss_1m = Guns("ХПСС-1М", 0.88, 46.6, 100, 45, 19.23, 50, 13, 9.19, 9.29, 0)
marta = Guns("Марта", 1, 12.67, 50.91, 31.77, 15.48, 1000, 15, 9.19, 9.29, 0)
volker_p_9m = Guns("Волкер-П-9М", 0.69, 16.98, 51, 7.06, 17.55, 50, 16, 9.19, 9.29, 0)
# Пистолеты .45
kora_919 = Guns("Кора-919", 1.1, 11.04, 50.84, 11.77, 16.93, 50, 7, 0.45, 0.46, 0)
sig_220 = Guns("СИП-т М200", 0.72, 20.18, 50.94, 17.65, 15.95, 50, 7, 0.45, 0.46, 0)
usp = Guns("УДП \"Компакт\"", 0.72, 16.87, 51, 20, 18, 50, 8, 0.45, 0.46, 0, )
deagle = Guns("Чёрный Ястреб", 1.7, 1, 25.14, 29.41, 14.29, 100, 8, 0.45, 0.46, 0)
# Дробовики
sawn_off_shotgun = Guns("Обрез", 1.9, 3.28, 50.64, 58.82, 30, 50, 2, 12.70, 12.76, 12.77)
toz_34 = Guns("Охотничье ружьё", 3.1, 60, 83.3, 90, 76.92, 70, 2, 12.70, 12.76, 12.77)
cheizer = Guns("Чейзер-13", 3.3, 16, 49.56, 68.24, 7.14, 50, 6, 12.70, 12.76, 12.77)
spas12 = Guns("СПСА-14", 4.8, 2.56, 31.56, 64.17, 10.71, 50, 8, 12.70, 12.76, 12.77)
bumper = Guns("Отбойник", 3.6, 53, 39.52, 57.7, 13.48, 200, 12, 12.70, 12.76, 12.77)
# Пистолет пулемёт
mp5 = Guns("Гадюка-5", 2.5, 26, 44.16, 7.06, 84.4, 200, 30, 9.19, 9.29, 0)
# Штурмовые винтовки
ak74_u = Guns("АКМ-74/2У", 3.02, 12.48, 42.2, 8.24, 45.86, 200, 30, 5.45, 5.46, 0)
ak74 = Guns("АКМ-74/2", 3.62, 22.7, 28.48, 8.24, 45.86, 1000, 30, 5.45, 5.46, 0)
abakan = Guns("АС-96/2", 4.22, 28, 24.86, 12.94, 45.86, 1000, 30, 5.45, 5.46, 0)
grom = Guns("Гром-с14", 3.67, 28.54, 45.77, 38.82, 73.35, 400, 20, 9.39, 9.40, 9.41)
lavina = Guns("ВАЛ Лавина", 2.97, 40.3, 46.59, 38.82, 54.06, 400, 20, 9.39, 9.40, 9.41)
IL86 = Guns("ИЛ86", 5.33, 23.2, 21.32, 17.65, 54.06, 800, 30, 5.56, 5.57, 0)
lr300 = Guns("ТРс-301", 3.03, 39.02, 32.51, 22.35, 73.35, 400, 30, 5.56, 5.57, 0)
sig550 = Guns("СГИ-5к", 4.33, 40.3, 18, 27.06, 63.23, 1000, 30, 5.56, 5.57, 0)
g36 = Guns("ГП37", 3.93, 43.22, 36.82, 29.41, 96.5, 600, 30, 5.56, 5.57, 0, )
fn2000 = Guns("ФТ-200м", 4.93, 38.68, 36.82, 41.18, 99, 400, 30, 5.56, 5.57, 0)
# Пулемёты
pkm = Guns("РП-74", 8.8, 43.3, 33.3, 90, 46.15, 150, 100, 7.62, 0, 0)
# Снайперские винтовки
vintorez = Guns("Винтарь-ВС", 3.43, 54.68, 46.59, 47.06, 45.86, 400, 10, 9.39, 9.40, 9.41)
svu = Guns("СВУмк-2", 4.63, 31.73, 5.4, 64.71, 15.48, 1000, 10, 7.62, 7.63, 7.64)
svd = Guns("СВДм-2", 5.13, 45.29, 1, 70.59, 8.57, 1000, 10, 7.62, 7.63, 7.64)
gauss = Guns("Гаусс-пушка", 6, 85.41, 18.75, 100, 2.14, 1000, 10, 6, 6, 0)
# Гранатомёты
rg6 = Guns("Бульдог-6", 6.68, 5.31, 50.75, 58.82, 7.14, 100, 6, 25, 26, 0)
rpg = Guns("РПГ-7у", 7.3, 100, 50.75, 100, 30, 400, 1, 100, 0, 0)
# Нож
knife = Guns("Нож", 0, 100, 100, 80, 7.14, 5, 1, 0, 0, 0)
